{
  "_name_or_path": "/rsrch4/home/bcb/she4/knowledgegraph/biobert_pytorch/biobert_basemodel",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Gene_or_gene_product",
    "1": "I-Gene_or_gene_product",
    "2": "I-Complex",
    "3": "I-Cellular_component",
    "4": "B-Cellular_component",
    "5": "B-Complex",
    "6": "B-Simple_chemical",
    "7": "O",
    "8": "I-Simple_chemical"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Cellular_component": 4,
    "B-Complex": 5,
    "B-Gene_or_gene_product": 0,
    "B-Simple_chemical": 6,
    "I-Cellular_component": 3,
    "I-Complex": 2,
    "I-Gene_or_gene_product": 1,
    "I-Simple_chemical": 8,
    "O": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.39.0.dev0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
